; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2312)
	(= (fuel plane1) 498)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at person1 city1)
	(at person2 city5)
	(at person3 city4)
	(at person4 city5)
	(at person5 city1)
	(at person6 city1)
	(at person7 city4)
	(at person8 city2)
	(at person9 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 563)
	(= (distance city0 city2) 926)
	(= (distance city0 city3) 667)
	(= (distance city0 city4) 682)
	(= (distance city0 city5) 542)
	(= (distance city1 city0) 563)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 751)
	(= (distance city1 city3) 637)
	(= (distance city1 city4) 690)
	(= (distance city1 city5) 997)
	(= (distance city2 city0) 926)
	(= (distance city2 city1) 751)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 732)
	(= (distance city2 city4) 513)
	(= (distance city2 city5) 758)
	(= (distance city3 city0) 667)
	(= (distance city3 city1) 637)
	(= (distance city3 city2) 732)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 570)
	(= (distance city3 city5) 759)
	(= (distance city4 city0) 682)
	(= (distance city4 city1) 690)
	(= (distance city4 city2) 513)
	(= (distance city4 city3) 570)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 732)
	(= (distance city5 city0) 542)
	(= (distance city5 city1) 997)
	(= (distance city5 city2) 758)
	(= (distance city5 city3) 759)
	(= (distance city5 city4) 732)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city1)
	(at person3 city3)
	(at person4 city0)
	(at person5 city0)
	(at person6 city3)
	(at person7 city0)
	(at person8 city0)
	(at person9 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 498 to 2312
   goals met: 0 of 9
2. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 926, (fuel plane1) from 2312 to 1386
   goals met: 0 of 9
3. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 9
4. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 926 to 1439, (fuel plane1) from 1386 to 873
   goals met: 0 of 9
5. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 9
6. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 0 of 9
7. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 1439 to 1952, (fuel plane1) from 873 to 360
   goals met: 0 of 9
8. (refuel plane1 city2)
   changed: (fuel plane1) from 360 to 2312
   goals met: 0 of 9
9. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1952 to 2703, (fuel plane1) from 2312 to 1561
   goals met: 0 of 9
10. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 0 of 9
11. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 0 of 9
12. (board person6 plane1 city1)
   deleted: (at person6 city1)
   added: (in person6 plane1)
   changed: (onboard plane1) from 5 to 6
   goals met: 0 of 9
13. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2703 to 3340, (fuel plane1) from 1561 to 924
   goals met: 0 of 9
14. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 6 to 5
   goals met: 1 of 9
15. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 5 to 4
   goals met: 2 of 9
16. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 3340 to 4072, (fuel plane1) from 924 to 192
   goals met: 2 of 9
17. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 4 to 3
   goals met: 3 of 9
18. (refuel plane1 city2)
   changed: (fuel plane1) from 192 to 2312
   goals met: 3 of 9
19. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4072 to 4998, (fuel plane1) from 2312 to 1386
   goals met: 3 of 9
20. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 9
21. (debark person7 plane1 city0)
   deleted: (in person7 plane1)
   added: (at person7 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 9
22. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 9
23. (fly plane1 city0 city5)
   deleted: (at plane1 city0)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 4998 to 5540, (fuel plane1) from 1386 to 844
   goals met: 6 of 9
24. (board person2 plane1 city5)
   deleted: (at person2 city5)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 9
25. (board person4 plane1 city5)
   deleted: (at person4 city5)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 9
26. (board person9 plane1 city5)
   deleted: (at person9 city5)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 6 of 9
27. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 5540 to 6082, (fuel plane1) from 844 to 302
   goals met: 6 of 9
28. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 7 of 9
29. (refuel plane1 city0)
   changed: (fuel plane1) from 302 to 2312
   goals met: 7 of 9
30. (zoom plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 6082 to 7771, (fuel plane1) from 2312 to 623
   goals met: 7 of 9
31. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 9
32. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
